# RepeaterCoordinates Properties

---
The RepeaterCoordinates type exposes the following members.
| Name| Description
---|---|---
| DimensionCount|  The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace